/*
2708: 平衡饮食
http://bailian.openjudge.cn/practice/2708/


描述
100克不同食品的营养成分含量如下表：食品--------蛋白质-------脂肪----------碳水化合物大米--------7.5----------0.75----------78面----------10-----------1.25----------75蔬菜--------1.5----------0.19----------4.28豆类--------35-----------18------------42蛋一只------5.0----------5.0-----------0.6瘦肉--------16.5---------28.8----------1.05牛肉--------17.7---------20.33---------4.06鱼----------14.9---------0.8-----------0.93食油--------0------------100-----------0水果--------0.85---------0.5-----------8各种营养成分所含热量如下： 蛋白质：4.1千焦耳/克；脂肪：9.3千焦耳/克；碳水化合物：4.1千焦耳/克。所谓平衡饮食是指食品的荤素搭配适当，蛋白质、脂肪和碳水化合物三者提供的热量之比应在14~16%:30~35%:49~56%之间。
输入
输入只有一行，该行包含十个整数，它们之间用空格隔开，分别表示大米、面、蔬菜、豆类、蛋、瘦肉、牛肉、鱼、食油、水果的摄入量。(鸡蛋的度量单位为只)
输出
输出只有一行，包含根据输入的饮食情况计算出来的平衡状态：平衡输出"yes"或者不平衡输出"no"(不必输出引号)。
样例输入
200 100 240 100 1 100 100 100 25 150
样例输出
no
提示
鸡蛋的度量单位为只！
来源
2005~2006医学部计算概论期末考试

*/

#include<iostream>
using namespace std;
int main()
{
	double protein[10]={7.5,10,1.5,35,5.0,16.5,17.7,14.9,0,0.85},fat[10]={0.75,1.25,0.19,18,5.0,28.8,20.33,0.8,100,0.5},carbon[10]={78,75,4.28,42,0.6,1.06,4.06,0.93,0,8};
	int weight[10];
	int i;
	double sump=0,sumf=0,sumc=0,sum=0;
	for(i=0;i<10;i++)
	{
		cin>>weight[i];
		if(i!=4)
		{
		sump+=protein[i]*weight[i]/100;
		sumf+=fat[i]*weight[i]/100;
		sumc+=carbon[i]*weight[i]/100;
		}
		else
		{
			sump+=protein[i]*weight[i];
		sumf+=fat[i]*weight[i];
		sumc+=carbon[i]*weight[i];
		}
	}
	sump*=4.1;
	sumf*=9.3;
	sumc*=4.1;
	sum=sump+sumf+sumc;
	if((sump/sum<=0.16)&&(sump/sum>=0.14)&&(sumf/sum<=0.35)&&(sumf/sum>=0.30)&&(sumc/sum<=0.56)&&(sumc/sum>=0.49))
		cout<<"yes"<<endl;
	else
		cout<<"no"<<endl;
    return 0;
}
