/*
2798: 2进制转化为16进制
http://bailian.openjudge.cn/practice/2798/


描述
输入一个2进制的数，要求输出该2进制数的16进制表示。在16进制的表示中，A-F表示10-15
输入
第1行是测试数据的组数n，后面跟着n行输入。每组测试数据占1行，包括一个以0和1组成的字符串，字符串长度至少是1，至多是10000
输出
n行，每行输出对应一个输入。
样例输入
2
100000
111

样例输出
20
7


*/

#include<iostream>
#include<string>
using namespace std;
int main()
{
	char str[10000];
	unsigned n,i,m,x,k;
	cin>>n;
	for(k=0;k<n;k++)
	{
		x=0;
		cin>>str;
		m=strlen(str);
		if((m==1)&&(str[0]=='0'))
				{cout<<"0"<<endl;continue;}
		
		if((m==2)&&(str[0]=='0')&&(str[1]=='0'))
				{cout<<"0"<<endl;continue;}
		
		if((m==3)&&(str[0]=='0')&&(str[1]=='0')&&(str[2]=='0'))
				{cout<<"0"<<endl;continue;}
	if(m%4==1)
		{
			if(str[0]=='1')
			{cout<<"1";x=1;}
		}
		if(m%4==2)
		{
			if((str[0]=='0')&&(str[1]=='1'))
			{cout<<"1";x=1;}
			if((str[0]=='1')&&(str[1]=='0'))
			{cout<<"2";x=1;}
			if((str[0]=='1')&&(str[1]=='1'))
			{cout<<"3";x=1;}
		}
				if(m%4==3)
		{
			if((str[0]=='0')&&(str[1]=='0')&&(str[2]=='1'))
			{cout<<"1";x=1;}
			if((str[0]=='0')&&(str[1]=='1')&&(str[2]=='0'))
			{cout<<"2";x=1;}
			if((str[0]=='0')&&(str[1]=='1')&&(str[2]=='1'))
			{cout<<"3";x=1;}
			if((str[0]=='1')&&(str[1]=='0')&&(str[2]=='0'))
			{cout<<"4";x=1;}
			if((str[0]=='1')&&(str[1]=='0')&&(str[2]=='1'))
			{cout<<"5";x=1;}
			if((str[0]=='1')&&(str[1]=='1')&&(str[2]=='0'))
			{cout<<"6";x=1;}
			if((str[0]=='1')&&(str[1]=='1')&&(str[2]=='1'))
			{cout<<"7";x=1;}
		}
		for(i=m%4;i<=m-1;i+=4)
	{
				if((x!=0)&&(str[i]=='0')&&(str[i+1]=='0')&&(str[i+2]=='0')&&(str[i+3]=='0'))
				{cout<<"0";}
            if((str[i]=='0')&&(str[i+1]=='0')&&(str[i+2]=='0')&&(str[i+3]=='1'))
			{cout<<"1";x=1;}
            if((str[i]=='0')&&(str[i+1]=='0')&&(str[i+2]=='1')&&(str[i+3]=='0'))
			{cout<<"2";x=1;}
            if((str[i]=='0')&&(str[i+1]=='0')&&(str[i+2]=='1')&&(str[i+3]=='1'))
			{cout<<"3";x=1;}
            if((str[i]=='0')&&(str[i+1]=='1')&&(str[i+2]=='0')&&(str[i+3]=='0'))
			{cout<<"4";x=1;}
            if((str[i]=='0')&&(str[i+1]=='1')&&(str[i+2]=='0')&&(str[i+3]=='1'))
			{cout<<"5";x=1;}
			if((str[i]=='0')&&(str[i+1]=='1')&&(str[i+2]=='1')&&(str[i+3]=='0'))
			{cout<<"6";x=1;}
            if((str[i]=='0')&&(str[i+1]=='1')&&(str[i+2]=='1')&&(str[i+3]=='1'))
			{cout<<"7";x=1;}
            if((str[i]=='1')&&(str[i+1]=='0')&&(str[i+2]=='0')&&(str[i+3]=='0'))
			{cout<<"8";x=1;}
            if((str[i]=='1')&&(str[i+1]=='0')&&(str[i+2]=='0')&&(str[i+3]=='1'))
			{cout<<"9";x=1;}
            if((str[i]=='1')&&(str[i+1]=='0')&&(str[i+2]=='1')&&(str[i+3]=='0'))
			{cout<<"A";x=1;}
            if((str[i]=='1')&&(str[i+1]=='0')&&(str[i+2]=='1')&&(str[i+3]=='1'))
			{cout<<"B";x=1;}
            if((str[i]=='1')&&(str[i+1]=='1')&&(str[i+2]=='0')&&(str[i+3]=='0'))
			{cout<<"C";x=1;}
            if((str[i]=='1')&&(str[i+1]=='1')&&(str[i+2]=='0')&&(str[i+3]=='1'))
			{cout<<"D";x=1;}
            if((str[i]=='1')&&(str[i+1]=='1')&&(str[i+2]=='1')&&(str[i+3]=='0'))
			{cout<<"E";x=1;}
            if((str[i]=='1')&&(str[i+1]=='1')&&(str[i+2]=='1')&&(str[i+3]=='1'))
			{cout<<"F";x=1;}
	}
		cout<<endl;
	}
	return 0;
}
