/*
2814: 拨钟问题
http://bailian.openjudge.cn/practice/2814/


描述
有9个时钟，排成一个3*3的矩阵。|-------|    |-------|    |-------||       |    |       |    |   |   ||---O   |    |---O   |    |   O   ||       |    |       |    |       ||-------|    |-------|    |-------|    A            B            C    |-------|    |-------|    |-------||       |    |       |    |       ||   O   |    |   O   |    |   O   ||   |   |    |   |   |    |   |   ||-------|    |-------|    |-------|    D            E            F    |-------|    |-------|    |-------||       |    |       |    |       ||   O   |    |   O---|    |   O   ||   |   |    |       |    |   |   ||-------|    |-------|    |-------|    G            H            I    (图 1)现在需要用最少的移动，将9个时钟的指针都拨到12点的位置。共允许有9种不同的移动。如下表所示，每个移动会将若干个时钟的指针沿顺时针方向拨动90度。 移动    影响的时钟  1         ABDE 2         ABC 3         BCEF 4         ADG 5         BDEFH 6         CFI 7         DEGH 8         GHI 9         EFHI    
输入
9个整数，表示各时钟指针的起始位置，相邻两个整数之间用单个空格隔开。其中，0=12点、1=3点、2=6点、3=9点。
输出
输出一个最短的移动序列，使得9个时钟的指针都指向12点。按照移动的序号从小到大输出结果。相邻两个整数之间用单个空格隔开。
样例输入
3 3 0 
2 2 2 
2 1 2 
样例输出
4 5 8 9 
来源
1166

*/

#include<iostream>
using namespace std;

int main()
{
	int a[10],b[10],c[10]={0,0,0,0,0,0,0,0,0,0},i;
	for(i=1;i<=9;i++)
	{
		 cin>>a[i];
		  
	}
	
	for(b[1]=0;b[1]<=3;b[1]++)
		for(b[2]=0;b[2]<=3;b[2]++)
			for(b[3]=0;b[3]<=3;b[3]++)
				for(b[4]=0;b[4]<=3;b[4]++)
					for(b[5]=0;b[5]<=3;b[5]++)
						for(b[6]=0;b[6]<=3;b[6]++)
							for(b[7]=0;b[7]<=3;b[7]++)
								for(b[8]=0;b[8]<=3;b[8]++)
									for(b[9]=0;b[9]<=3;b[9]++)
									{
										c[1]=(a[1]+b[1]+b[2]+b[4])%4;
										c[2]=(a[2]+b[1]+b[2]+b[3]+b[5])%4;
										c[3]=(a[3]+b[2]+b[3]+b[6])%4;
										c[4]=(a[4]+b[1]+b[4]+b[5]+b[7])%4;
										c[5]=(a[5]+b[1]+b[3]+b[5]+b[7]+b[9])%4;
										c[6]=(a[6]+b[3]+b[5]+b[6]+b[9])%4;
										c[7]=(a[7]+b[4]+b[7]+b[8])%4;
										c[8]=(a[8]+b[5]+b[7]+b[8]+b[9])%4;
										c[9]=(a[9]+b[6]+b[8]+b[9])%4;
										if((c[1]+c[2]+c[3]+c[4]+c[5]+c[6]+c[7]+c[8]+c[9])==0)
										{
											for (i=0; i<b[1]; i++) cout<<"1 ";
											for (i=0; i<b[2]; i++) cout<<"2 ";
											for (i=0; i<b[3]; i++) cout<<"3 ";
											for (i=0; i<b[4]; i++) cout<<"4 ";
											for (i=0; i<b[5]; i++) cout<<"5 ";
											for (i=0; i<b[6]; i++) cout<<"6 ";
											for (i=0; i<b[7]; i++) cout<<"7 ";
											for (i=0; i<b[8]; i++) cout<<"8 ";
											for (i=0; i<b[9]; i++) cout<<"9 ";
											return 0;
										}
									}
	return 0;
}
